/* JawaScript - Рекурсия и стек */
'use strict';

alert("Start _RecSimpl_FUNCAdvRec");


function pow(x, n) {
    if (n == 0) {
      return 1;    // перший і єдиний результат для n=0 / останній результат у ланцюгу обчислень від n=max до n=0
    } else {
      return x * pow(x, n - 1);
    }
}

alert( pow(2, 0) ); // 1        тільки перший результат
alert( pow(2, 1) ); // 2        другий результат чекає першого і, отримавши перший, завершується
alert( pow(2, 3) ); // 8        третій результат чекає другого, другий результат чекає першого і (отримавши перший) завершується,
                    //                  третій (отримавши другий (через перший)) завершується 


alert("End");
