/* JawaScript - animal_walk_NasledPrototype 
- Прототипы и наследование
Значенням властивості об'єкту obj: __proto__ може бути об'єкт або null. Другі типи ігноруються.

Насправді __proto__ - це не звичайна властивість об'єкту, а аксессор до прихованої властивості [[Prototype]] об'єкту 
(до значення, записаного у приховану властивість [[Prototype]], і яке є об'єкт прототип). Аксессор знаходиться у Object.prototype. 
Коли ми звертаємося obj.__proto__, JS спочатку шукає цю властивість-аксессор у самому об'єкті, а не знайшовши - 
продовжує пошук по ланцюжку прототипів. Знайшовши у Object.prototype аксессор get.__proto__/set.__proto__ JS відповідно 
отримує/записує значення (об'єкт прототип або Null) у приховану властивість [[Prototype]] в самому об'єкті obj.

(бо при звертанні з об'єкту до відсутнього у нього методу (obj.String), знайдений у якомусь із прототипів метод записує 
результат-значення у наново-створювану приховану змінну у самому об'єкті, з якого викликався метод)
*/
'use strict';

alert("Start animal_walk_NasledPrototype");



let animal = {
    eats: true,
    walk() {
      alert("Animal walk");
    }
};
  
let rabbit = {
    jumps: true,
    __proto__: animal   // встановлюєм для rabbit прототип animal
};
  
// walk взят из прототипа
rabbit.walk();              // Animal walk   (унаслідуваний метод)



alert("End");

