/* JawaScript - 10_write2_IzmenDokumentaDocument         document.write
Вызов document.write(html) записывает html на страницу «прямо здесь и сейчас». 
Строка html может быть динамически сгенерирована, поэтому метод достаточно гибкий.
Мы можем использовать JavaScript, чтобы создать полноценную веб-страницу и записать её в документ.

Вызов document.write работает только во время загрузки страницы.
Если вызвать его позже, то существующее содержимое документа затрётся.
*/

'use strict';
alert("Start 10_write2_IzmenDokumentaDocument");



  



/*
Так что после того, как страница загружена, он уже непригоден к использованию, в отличие от других методов DOM, 
которые мы рассмотрели выше.
*/

alert("End");