/* JawaScript - 2_mousemove_mouseoverEnterINTERFACEevents               

Событие mousemove происходит при движении мыши. Однако, это не означает, что указанное событие генерируется при прохождении каждого пикселя.

Браузер периодически проверяет позицию курсора и, заметив изменения, генерирует события mousemove.

Это означает, что если пользователь двигает мышкой очень быстро, то некоторые DOM-элементы могут быть пропущены:
*/

'use strict';
alert("Start 2_mousemove_mouseoverEnterINTERFACEevents");





alert("End");